Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.authentik_system.data.kubernetes_service_v1.authentik_server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service_v1" "authentik_server" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "authentik-server"
          + namespace        = "authentik"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.authentik_system.helm_release.authentik will be created
+ resource "helm_release" "authentik" {
      + atomic                     = false
      + chart                      = "authentik"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "authentik"
      + namespace                  = "authentik"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.goauthentik.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                authentik:
                    error_reporting:
                        enabled: true
                    email:
                      host: "smtp.zoho.com"
                      port: 465
                      username: "bill@vandenberk.me"
                      use_tls: false
                      use_ssl: true
                      timeout: 10
                      from: "Authentik <bill@vandenberk.me>"
                
                server:
                    ingress:
                        enabled: false
                
                postgresql:
                    enabled: true
                    primary:
                      persistence:
                        storageClass: longhorn
                redis:
                    enabled: true
                    primary:
                      persistence:
                        storageClass: longhorn
                
                worker:
                    env:
                        - name: AUTHENTIK_BOOTSTRAP_PASSWORD
                        - name: AUTHENTIK_BOOTSTRAP_EMAIL
                          value: bill@vandenberk.me
                        - name: AUTHENTIK_BOOTSTRAP_TOKEN
            EOT,
        ]
      + verify                     = false
      + version                    = "2025.6.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```